import { SlashCommandBuilder, AttachmentBuilder } from 'discord.js';

const CURSE_IMAGE = "https://raw.githubusercontent.com/tegberen/pokemonAutoChessBot/main/src/assets/curse.jpg";

export const data = new SlashCommandBuilder()
  .setName('curse')
  .setDescription('me olmec, you curse ritual');

export async function execute(interaction: any) {
  await interaction.reply({
    content: "⚐︎♒︎🕯︎ ☹︎□︎❒︎♎︎ ⧫︎♒︎♋︎⧫︎ ⬥︎♒︎♓︎♍︎♒︎ ⧫︎♒︎⍓︎ ⬧︎♒︎♋︎●︎●︎ ♌︎♏︎📪︎ □︎♐︎ ⧫︎♒︎♏︎ ✌︎●︎❍︎♓︎♑︎♒︎⧫︎⍓︎ ♌︎♏︎♓︎■︎♑︎📬︎ ✋︎ ⬧︎♒︎♋︎●︎●︎ ⬧︎◻︎❒︎♏︎♋︎♎︎ ⧫︎♒︎♏︎ ☹︎□︎❒︎♎︎🕯︎⬧︎ ♐︎♋︎♓︎⧫︎♒︎📪︎ ♍︎□︎❍︎❍︎♓︎⧫︎ ⬧︎♓︎■︎⬧︎ ◆︎■︎♎︎♏︎❒︎ ⍓︎□︎◆︎❒︎ ♑︎◆︎♓︎♎︎♋︎■︎♍︎♏︎📪︎ ⬧︎□︎ ◻︎●︎♏︎♋︎⬧︎♏︎📪︎ ●︎♏︎■︎♎︎ ❍︎♏︎ ⍓︎□︎◆︎❒︎ ♌︎●︎♏︎⬧︎⬧︎♓︎■︎♑︎ ♋︎■︎♎︎ ♒︎♏︎♏︎♎︎⬧︎ ❍︎⍓︎ ⬥︎□︎❒︎♎︎⬧︎📪︎ 🏱︎☹︎💧︎ ☝︎✋︎✞︎☜︎ ⚐︎☝︎☜︎☼︎🏱︎⚐︎☠︎",
    files: [CURSE_IMAGE]
  });
}